W12D2/authenticate-me/app/controllers/api/users_controller.rb

INSERT INTO "users" ("email", "username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    # render json: user_params
    @user = User.new(user_params)
    if @user.save