W12D2/authenticate-me/app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Demo-lition"], ["LIMIT", 1]]
---
  def self.find_by_credentials(credential, password)
    credential =~ URI::MailTo::EMAIL_REGEXP ?
      user = User.find_by(email: credential) :
      user = User.find_by(username: credential)

SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]
---
  def generate_unique_session_token
    token = SecureRandom.urlsafe_base64
    while User.exists?(session_token: token)